app/controllers/recipes_controller.rb

SELECT "recipes".* FROM "recipes" WHERE "recipes"."id" = ? LIMIT ?  [["id", 19], ["LIMIT", 1]]
---
  def show
    temp_recipe = Recipe.find(params[:id])

INSERT INTO "recipes" ("ingredients", "origin", "title", "created_at", "updated_at", "instructions", "requirements") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @recipe = Recipe.new(ingredients: params[:recipe][:ingredients], origin: params[:recipe][:origin],
                         title: "...", instructions: "...", requirements: "...")
    if @recipe.save