app/controllers/recipes_controller.rb

  def create
    @recipe = Recipe.new(ingredients: params[:recipe][:ingredients], origin: params[:recipe][:origin], response: "...")
    if @recipe.save
---
INSERT INTO "recipes" ("ingredients", "origin", "response", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["ingredients", "hi"], ["origin", "hi"], ["response", "..."], ["created_at", "2023-02-05 02:21:38.575680"], ["updated_at", "2023-02-05 02:21:38.575680"]]